/* Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
m = 2, n = 3 -> A(m,n) = 29*/

Console.Write("Input integer: ");
int m = int.Parse(Console.ReadLine());
Console.Write("Input integer: ");
int n = int.Parse(Console.ReadLine());


