// Задача 8: Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.
// Пример: "5" -> 2, 4   /  "8" -> 2, 4, 6, 8

Console.Write("Input your integer: ");
int num = int.Parse(Console.ReadLine());

int[] nums = new int[num];
for (int i = 0;)
{
    
}

numEn = 0 

int numen = (num % 2);