// Задача 10: Напишите программу, которая принимает на вход
// трёхзначное число и на выходе показывает вторую цифру этого числа

Console.Write("Input your integer: ");
int num = int.Parse(Console.ReadLine());

